Repository: neo321654/keep-mindful-master
Catalog: lib/l10n/intl_*.arb
Languages: ru

# bluetoothTurnOnHint
source: Use Bluetooth to connect the ring
ru: Используйте Bluetooth для подключения кольца

# bluetoothAvailableDevices
source: Available devices
ru: Доступные устройства

# bluetoothConnectHintFirst
source: Press
ru: Нажмите

# bluetoothConnectHintSecond
source: to pair
ru: для сопряжения

# bluetoothToScan
source: Scan
ru: Сканировать

# bluetoothTurnOnButton
source: Enable Bluetooth
ru: Включить Bluetooth

source: Hours
ru: Часы

source: Minutes
ru: Минуты

source: Seconds
ru: Секунды

# timerTitle
source: Timer
ru: Таймер

# timerSetDuration
source: Set the duration
ru: Установить длительность

source: min
ru: мин

# intervalSave
source: Save
ru: Сохранить

# intervalTitle
source: Interval
ru: Интервал

# durationTitle
source: Duration
ru: Длительность

source: Intensity
ru: Интенсивность

# intensityVibration
source: Vibration
ru: Вибрация

# intensityDischarge
source: Charge
ru: Шокер

# intensityCheckSelectedIntensity
source: Check the selected intensity
ru: Проверить выбранную интенсивность

# settingsTitle
source: Settings
ru: Настройки

# settingsTheme
source: Theme
ru: Тема

# settingsNotifications
source: Notifications
ru: Уведомления

# settingsBatteryLow
source: Low battery charge
ru: Низкий заряд батареи

# settingsDetails
source: Intelligence
ru: Сведения

# settingsAboutApp
source: About the app
ru: О приложении

# settingsTermsConditions
source: Privacy policy
ru: Политика конфиденциальности

# settingsFaq
source: FAQ
ru: Часто задаваемые вопросы

# themeTitle
source: Setting up a theme
ru: Настройка темы

# themeDark
source: Dark
ru: Темная

# themeLight
source: Light
ru: Светлая

# themeSystem
source: System Setup
ru: Системная настройка

# aboutAppTitle
source: About the app
ru: О приложении

# termsConditionsTitle
source: Privacy policy
ru: Политика конфиденциальности

# faqTitle
source: FAQ
ru: Часто задаваемые вопросы

# metronomeTitle
source: Metronome
ru: Метроном

# awakeningTitle
source: Awakening
ru: Пробуждение

# metronomeNumberOfBars
source: Number of bars
ru: Количество тактов

# metronomePace
source: Pace
ru: Темп

# metronomeSoundSwitherTitle
source: 1 bar with sound and 1 bar without sound
ru: 1 такт с звуком и 1 такт без звука

# awakeningAlarmClocks
source: Alarm clocks
ru: Будильники

# awakeningAlarmsEmpty
source: You don't have any alarm clocks added yet
ru: Вы еще не добавили ни одного будильника

# awakeningAlarmAdd
source: Add
ru: Добавить

# awakeningAlarmRemove
source: Delete an alarm clock
ru: Удалить будильник

# awakeningAlarmSave
source: Save
ru: Сохранить

# awakeningAlarmDisableQrTitle
source: To turn off the alarm, you will need to scan this QR code
ru: Чтобы выключить будильник, вам понадобится отсканировать этот QR-код

# awakeningAlarmDisableQrHint
source: You can choose how to turn off the alarm in the app Settings
ru: Вы можете выбрать способ отключения будильника в настройках приложения

# awakeningAlarmQrDownload
source: Download
ru: Скачать

# wakeUpModeTitle
source: Disabling the "Wake Up" mode
ru: Отключение режима "Пробуждения"

# wakeUpModeQr
source: Scan the QR code
ru: Отсканируйте QR-код

# wakeUpModeMathExcercise
source: Solve a mathematical problem
ru: Решите математическую задачу

# wakeUpCaptcha
source: Captcha
ru: Капча

# settingsWakeUpMode
source: Disabling the "Wake Up" mode
ru: Отключение режима "Пробуждения"

# settingsWakeUpShowQrButton
source: Show QR code
ru: Показать QR-код

# alarmDisableQrTitle
source: To turn off the alarm, scan the QR code
ru: Чтобы выключить будильник, отсканируйте QR-код

# alarmDisableAnotherWayButton
source: Disable it in another way
ru: Выключить другим способом

# alarmDisableMathExcerciseTitle
source: To turn off the alarm, you need to solve the problem:
ru: Чтобы выключить будильник, вам нужно решить задачу:

# alarmDisableMathExcerciseInputHint
source: Answer
ru: Ответ

# alarmDisableQrConfirmed
source: The alarm is off
ru: Будильник выключен

# bluetoothDevicesSearchButton
source: Scan
ru: Сканировать

# faqQuestion
source: Is vibration in the ring dangerous for humans?
ru: Вибрация в кольце опасна для человека?

# faqAnswer
source: No, such vibration cannot cause any harm to human health.
ru: Нет, такая вибрация не может нанести вред здоровью человека.

# faqQuestion1
source: Can a person with a pacemaker use this ring?
ru: Можно ли использовать это кольцо человеку с кардиостимулятором?

# faqAnswer1
source: Yes, they can. In 'vibration' mode, any intensity level can be used. In 'shocker' mode, a reduced intensity level should be used and consultation with a doctor is advised before use.
ru: Да, можно. В режиме 'вибрация' можно использовать любой уровень интенсивности. В режиме 'шокер' рекомендуется использовать сниженный уровень интенсивности и проконсультироваться с врачом перед использованием.

# faqQuestion2
source: Why should I choose a ring instead of a wristband to use as an alarm or reminder?
ru: Почему мне стоит выбрать кольцо вместо наручного браслета для использования в качестве будильника или напоминания?

# faqAnswer2
source: Vibration in 'Wake-up' mode will provide you with a gentle and silent wake-up, and if that is not enough, the 'shocker' function will help you fully wake up. If you need the ring to vibrate, for example, every 15-20 seconds for an hour, you would need to set up more than 200 alarms on a smartwatch. This program can be set up in a few clicks in the ring's app.
ru: Вибрация в режиме 'Wake-up' позволит вам мягко и бесшумно проснуться, а если этого недостаточно, функция 'шокер' поможет вам полностью проснуться. Если вам необходимо, чтобы кольцо вибрировало, например, каждые 15-20 секунд в течение часа, то на смарт-часах вам потребуется создать более 200 будильников. Эту программу можно настроить всего в несколько кликов в приложении кольца.

# faqQuestion3
source: How long does the ring hold a charge?
ru: Как долго кольцо держит заряд батареи?

# faqAnswer3
source: In average usage mode, it lasts for 15-20 hours.
ru: В среднем режиме использования оно длится 15-20 часов.

# faqQuestion4
source: Can I connect more than one ring to the app?
ru: Можно ли подключить к приложению несколько колец?

# faqAnswer4
source: No.
ru: Нет.

# faqQuestion5
source: What voltage does the shocker produce?
ru: Какое напряжение вырабатывает шокер?

# faqAnswer5
source: From 50V to 150V.
ru: От 50V до 150V.

# faqQuestion6
source: Is this voltage dangerous for human health?
ru: Опасно ли это напряжение для здоровья человека?

# faqAnswer6
source: No. The impact in 'shocker' mode is very brief and cannot harm a healthy organism.
ru: Нет. Воздействие в режиме 'шокер' очень кратковременное и не может нанести вред здоровому организму.

# faqQuestion7
source: What is the battery capacity?
ru: Какая емкость батареи?

# faqAnswer7
source: 50mA.
ru: 50 мАч.

# faqQuestion8
source: How long can the ring work without charging in standby mode?
ru: Как долго кольцо может работать без зарядки в режиме ожидания?

# faqAnswer8
source: Up to two days.
ru: До двух дней.

# faqQuestion9
source: What is the ring's level of water resistance?
ru: Какой уровень водостойкости у кольца?

# faqAnswer9
source: IPX4 means that the device is resistant to water only at the splash level. The ring can be worn on rainy days and during hand washing, but it cannot be submerged in water.
ru: IPX4 означает, что устройство устойчиво только к брызгам воды. Кольцо можно носить в дождливые дни и во время мытья рук, но его нельзя погружать в воду.

# faqQuestion10
source: How will the ring work when it loses connection with the mobile app?
ru: Как будет работать кольцо при потере связи с мобильным приложением?

# faqAnswer10
source: Only the basic settings programmed into the gadget will be saved. When the ring returns to the Bluetooth signal range of the mobile device, the settings of the previously set mode will be restored.
ru: Будут сохранены только основные настройки, запрограммированные в гаджете. Когда кольцо вернется в диапазон Bluetooth сигнала мобильного устройства, настройки ранее установленного режима будут восстановлены.

source: Not connected
ru: Не подключено

# captchaTitle
source: To turn off the alarm, enter the word from the picture:
ru: Введи слово с картинки, чтобы отключить будильник:

# captchaInputHint
source: Enter the word
ru: Введите слово

# settingsLanguage
source: Language
ru: Язык

# languageTitle
source: Setting up language
ru: Настройка языка

# batteryIndicatorSemanticsLabel
source: Battery indicator
ru: Индикатор батареи

# playPauseSemanticsLabel
source: Play/Pause
ru: Воспроизведение и пауза

# resetSemanticsLabel
source: Reset
ru: Сброс

# previousSemanticsLabel
source: Previous
ru: Назад

# nextSemanticsLabel
source: Next
ru: Вперед
